# Дан список чисел .Определить сколько в нем получается различных чисел.
# input[1,1,2,0,-1,3,4,4] outpt [6]


spisok = [1, 1, 2, 0, -1, 3, 4, 4, 5,-5,5]
mnoj = set(spisok)
print (len(mnoj))
